import React, { useState } from "react";
import Navbar from "../navbar/navbar"; // імпорт компонента Navbar

// Приклад місць
const places = [
  {
    id: 1,
    title: "Вілла Грушевських",
    description: "Необароко. Вілла була побудована для родини Михайла Грушевського, одного з основоположників української історії.\
    Родина жила тут до 1914 року, поки Грушевський не поїхав на відпочинок, а з початком Першої світової війни вже не повернувся.\
    Після війни вілла була передана на опіку, і в різні періоди в ній мешкали відомі особи, серед яких — Філарет Колесса і Тарас Франко.\
    З 1998 року в будівлі функціонує Державний меморіальний музей Михайла Грушевського. Вілла знаходиться в мальовничій частині Львова, поблизу Стрийського парку.\
    Садиба має великий двір, де було висаджено сад, що нині є частиною музейного комплексу. Перед будівлею стоїть стела з барельєфом Михайла Грушевського\
    В наш час вілла є частиною музею, де відтворено інтер'єри кімнат, зокрема кабінету Грушевського та гуцульської світлиці. Експозиція музею знайомить відвідувачів із життям і діяльністю Грушевського​",
    image: "./images/Villa_Hrushevsky.png",
    location: "вул. Франка, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=1",
    category: "Будинки",
  },
  {
    id: 2,
    title: "Будинок страхового товариства \"Дністер\"",
    description: "Модернізм (сецесія)\
    Будівля була спроектована для розміщення першої української страхової компанії «Дністер», заснованої в 1892 році. Від 1895 року тут знаходився і кооперативний банк «Дністер». Крім того, в будівлі були розташовані спортивні зали для українського гімнастичного товариства\
    «Сокіл-Батько». Після націоналізації в 1940 році будівля використовувалася як спортивна база, а згодом і для інших функцій. Зараз у приміщенні знаходиться міська поліклініка     Будинок має складний план і три поверхи. Він вирізняється оригінальними архітектурними елементами,\
    такими як декоративні керамічні панелі, металеві решітки та орнаменти, що відображають національні українські мотиви      Унікальні деталі, як-от дашок, схожий на бойківський, та гуцульські орнаменти, роблять будівлю важливою частиною архітектурної спадщини Львова\
    Після реставрації фасаду, яка була завершена в останні роки, будівля знову стала яскравим елементом міської архітектури. Зараз вона є частиною комунальної власності, а її історичні зали використовуються для культурних та медичних потреб",
    image: "./images/Dnister_Building.png",
    location: "вул. Матейка, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=2",
    category: "Природні",
  },
  {
    id: 3,
    title: "Галицька ощадна каса",
    description: "Історизм/неоренесанс/бароко\
    З початку XX століття, будівля виконувала функції ощадної каси для мешканців Галичини. В роки Другої світової війни вона пережила окупацію та була пошкоджена, однак після реконструкції в середині\
    20 століття стала музеєм Будівля має три поверхи та складну планування. Окрасою є центральна ротонда з куполом, а фасади прикрашені поліхромною цеглою та майолікою. Усередині збереглися автентичні інтер'єри,\
    включаючи мармурові сходи та вітражі, виконані австрійськими майстрами\
    Сьогодні будівля є частиною Музею етнографії та художнього промислу, де зберігається понад 80 000 експонатів, які демонструють різноманітність української культури і побуту від XVI до XX століття",
    image: "./images/Galycka_Oshchadna_Kasa.png",
    location: "проспект Свободи, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=3",
    category: "Культурні",
  },
  {
    id: 4,
    title: "Гранд Готель",
    description: "Ампір/неоренесанс/необароко\
    Готель відкрили в 1893 році і відразу став одним із символів розкоші і модерності для Львова. У його інтер'єрах були встановлені передові технології того часу,\
    такі як електричне освітлення. Протягом своєї історії будівля змінювала власників і функції: після Другої світової війни вона була готелем \"Львів\", а пізніше \"Верховина\".\
    Відновлення готелю почалося в 1991 році, і на початку 2000-х він отримав статус одного з найсучасніших готелів Львова​. Ґранд-Готель має чотири поверхи з мансардним поверхом,\
    зберігаючи витончені архітектурні форми і розкішний інтер'єр. В інтер'єрі використано стильні елементи декору, а також вітраж \"Галичина\" в вестибюлі. Одним із його головних прикрас є фасад,\
    оздоблений скульптурними елементами, а також розкішний ресторан і сучасні номери. Готель є частиною більшого комплексу, включаючи Пасаж Гаусмана, який також належав до цього комплексу, створюючи єдину архітектурну композицію\
    Сьогодні Ґранд-Готель є одним з найбільш розкішних готелів Львова, відомим не лише завдяки високому рівню комфорту, але і своєму історичному шарму. Він є популярним місцем серед туристів\
    і місцевих жителів, а також активно бере участь у культурному житті міста. Після чергової реконструкції в 2018 році, готель знову став важливим елементом львівського архітектурного ландшафту",
    image: "./images/Grand_Hotel.png",
    location: "проспект Свободи, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=4",
    category: "Культурні",
  },
  {
    id: 5,
    title: "Будинок учених",
    description: "Необароко\
    Спочатку це було казино, відоме як \"казино Герхарда\",\
    Після 1948 року споруду переіменували в обласний будинок вчених, а в 2008 році вона була включена до реєстру пам'яток, які не підлягають приватизації.\
    Інтер'єри будівлі вражають своєю розкішшю: на першому поверсі розташовані розкішні зали, серед яких актова зала, Біла і Червона зали, а також бібліотека. Серед вражаючих елементів—атланти, що підтримують балкони, і скульптури, які прикрашають фасад",
    image: "./images/House_of_Scientists.png",
    location: "вул. Листопадового Чину, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=5",
    category: "Культурні",
  },
  {
    id: 6,
    title: "Будинок з химерами",
    description: "Неоготика.\
    Будинок був спроектований для особистого проживання Городецького, але через фінансові труднощі він змушений був продати його в 1913 році.\
    Спочатку в будинку були розташовані численні квартири, а також майстерня архітектора. Власники будівлі змінювались протягом років.\
    Особливістю цього будинку є його екстравагантний фасад, який прикрашений скульптурами тварин і химер, зокрема слонів, жаб, носорогів і змій.\
    Оздоблення включає також деталі, натхнені фантастичними істотами, а стіни першого поверху оброблені колоритними орнаментами\
    Сьогодні будівля залишається важливою архітектурною пам'яткою, привертаючи туристів завдяки своєму неповторному стилю та історії.\
    Вона є частиною архітектурного обличчя Львова і привертає увагу не лише завдяки своєму вигляду, а й історії, що пов'язана з Городецьким​",
    image: "./images/House_with_Chimeras.png",
    location: "вул. Франка, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=6",
    category: "Культурні",
  },
  {
    id: 7,
    title: "Пластиліновий будинок",
    description: "Модерн.\
    Пластиліновий будинок був побудований на початку 20 століття, коли модерн був популярним напрямом в архітектурі.\
    Оскільки будівля має екстравагантні форми та вигадливий декор, її називають «пластиліновою» через асоціацію з гнучкістю цього матеріалу.\
    Будинок відрізняється об'ємними декоративними елементами, які створюють ілюзію, ніби частини фасаду «стікають» або «плавляться».\
    Цей вигляд робить будівлю однією з найцікавіших в архітектурному ландшафті Львова\
    Сьогодні Пластиліновий будинок є популярною туристичною пам'яткою.\
    Він активно привертає увагу завдяки своїй унікальній архітектурі, що виділяється серед інших будівель Львова",
    image: "./images/Plasticine_House.png",
    location: "вул. Цетнерівка, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=7",
    category: "Культурні",
  },
  {
    id: 8,
    title: "Костел і монастир Святого Лазаря",
    description: "Ренесанс/готика\
    Цей комплекс спочатку служив шпиталем для немічних та бідних, і був заснований італійським братством святого Розарія.\
    Протягом часу тут також функціонувала лікарня і притулок для старців. Після радянської влади храм було закрито, а будівлі передано військовим.\
    У 1989 році будівлю передали дитячому хору \"Дударик\", а з початку 2000-х років відновили богослужіння​. Будівля костелу невелика, однонефна з прямокутною апсидою. Біля апсиди розташовані невисокі\
    три'ярусні вежі з шатровими дахами. Інтер'єр костелу стриманий, з мінімальною кількістю декору. Проте, перед входом у храм збереглися цікаві плоскорізи, що зображають сцени з притчі про Лазаря\
    На сьогодні костел є частиною культурного комплексу, де проводяться екуменічні богослужіння. Тут також розташовується хорова капела, і храм залишається важливим осередком духовного життя Львова",
    image: "./images/Monastery_Lazar.png",
    location: "вул. Лазаря, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=8",
    category: "Культурні",
  },
  {
    id: 9,
    title: "Монастир святого Онуфрія",
    description: "Початково монастир був дерев'яним, і впродовж наступних століть він неодноразово перебудовувався через різні руйнації, включаючи татарські набіги. Зокрема, у 1672 році храм було відновлено після значних пошкоджень.\
    У середині XVI століття почалося будівництво мурованої церкви на кошти князя Костянтина Острозького. Завершення основного будівництва церкви відбулося лише у 1902 році, коли монастир набув свого сучасного вигляду, зокрема завдяки перебудовам у XIX столітті\
    Сьогодні монастир і церква Святого Онуфрія є важливими культурними пам'ятками, що зберігають духовну та історичну спадщину Львова",
    image: "./images/Monastery_Onufriy.png",
    location: "вул. Богдана Хмельницького, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=9",
    category: "Культурні",
  },
  {
    id: 10,
    title: "Палац Семенських-Левицьких",
    description: "Палац належав графу Костянтину Семенському і його родині, зокрема їхньому синові Вільгельму-Станіславу, який додав подвійне прізвище Семенський-Левицький після шлюбу з Олімпією Левицькою. Родина володіла палацом до кінця Другої світової війни. Після війни палац був націоналізований і\
    використовувався для різних навчальних закладів. Після розпаду СРСР нащадки родини намагалися повернути палац, але документи підтвердили, що він належить місту через гральний борг. Палац розташований на великій ділянці з огорожею. Перед головним фасадом є простора площа з клумбами,\
    а територія оточена бічними флігелями. Вхід до палацу здійснюється через металеву кутову браму, а в'їзд до манежу прикрашений керамічними головами коней.\
    Внутрішнє планування спочатку було анфіладно-зальним, але після реконструкцій стало коридорним\
    Сьогодні палац займає школа-інтернат №102 для дітей з особливими потребами. Хоча доступ до палацу обмежений, територія і зовнішній вигляд будівлі все ще приваблюють туристів і є частиною історичної спадщини Львова.",
    image: "./images/Palac Semenskih-levyckih.png",
    location: "вул. Пекарська, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=10",
    category: "Культурні",
  },
  {
    id: 11,
    title: "Палац Бесядецьких",
    description: "Бароко, пізніше рококо,ампір і неокласицизм.\
    Палац належав кільком аристократичним родам, включаючи Потоцьких і Бесядецьких. У XIX столітті палац був часто перебудований,\
    і на початку XX століття став частиною міського архітектурного ландшафту. Після Другої світової війни в будівлі розмістилася\
    Львівська обласна бібліотека. Після 2000 року палац перейшов у власність Львівського університету імені Івана Франка.\
    Палац розташований на площі Галицькій, 10. Це двоповерхова будівля, виконана з цегли та тинькована, з мансардним дахом.\
    Вікна обрамлені рокайльним декором, а над головним входом розташований кам'яний картуш з гербом. Внутрішнє планування спочатку\
    було анфіладно-зальним, але пізніше перероблене в коридорно-секційне\
    На даний момент палац є частиною Львівського університету і проходить реставрацію.\
    Зараз планується створення навчально-наукового центру в палаці, і в будівлі будуть проводити репрезентаційні заходи для гостей університету",
    image: "./images/Palace_Besyadetskykh.png",
    location: "вул. Університетська, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=11",
    category: "Культурні",
  },
  {
    id: 12,
    title: "Палац графа Голуховського",
    description:'Неоренесанс/неоготика.\n\
    Спочатку він належав графу Агенору Голуховському, відомому політичному діячу, і був використаний як резиденція для сім\'ї\
    Будівля має три поверхи і мансарду, і розташована на вулиці Листопадового Чину. Оригінальний проект передбачав величезні вітальні для прийомів і зустрічей, що підкреслювали статус власника.\
    Проте після смерті графа та політичних змін палац неодноразово змінював власників і функції, навіть слугував палацом піонерів у радянський час.\
    Під час польсько-українських боїв у 1918 році палац був пошкоджений, а в міжвоєнний період відновлений. Після Другої світової війни тут розташовувалися різні установи.\
    Зараз в будівлі працює діагностичний центр лікарні Львівської залізниці, хоча реставрація палацу триває, і будівля зберігає свій історичний вигляд',
   
    image: "./images/Palace_Goluhovsky.png",
    location: "вул. Шевченка, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=12",
    category: "Історичні",
  },
  {
    id: 13,
    title: "Палац Сосновського",
    description: "Псевдоготика з елементами венеційської готики\
    Архітектором палацу був Юзеф Сосновський, який також був його першим власником. Палац, з характерними для готики ліпними деталями та скульптурними композиціями, нагадує середньовічний замок і має гарно збережену ліпнину та\
    ковані елементи Спочатку Сосновський проживав у палаці, але згодом продав його колекціонеру Францішку Бесядецькому. З того часу будівля інколи також називається палацом Бесядецького\
    Сьогодні палац є об'єктом культурної спадщини та активно реставрується для збереження архітектурних деталей",
    image: "./images/Palace_Sosnovskogo.png",
    location: "вул. Мельника, Львів, Львівська область, 79000",
    map: "https://www.google.com/maps?q=13",
    category: "Історичні",
  },
  
];  

const Places = () => {
  const [selectedPlace, setSelectedPlace] = useState(null);
  const [searchTerm, setSearchTerm] = useState("");
  const [selectedCategory, setSelectedCategory] = useState("Всі категорії");

  const handlePlaceClick = (place) => {
    setSelectedPlace(place);
  };

  const handleCloseModal = () => {
    setSelectedPlace(null);
  };

  const filteredPlaces = places.filter((place) => {
    const matchesSearch = place.title.toLowerCase().includes(searchTerm.toLowerCase());
    const matchesCategory =
      selectedCategory === "Всі категорії" || place.category === selectedCategory;

    return matchesSearch && matchesCategory;
  });

  return (
    <div className="bg-gray-100 text-black min-h-screen">
      {/* Navbar */}
      <Navbar />

      <section className="flex pt-24">
        {/* Фільтри зліва */}
        <div className="w-[15%] bg-gray-200 p-4 ml-6 mt-4 shadow h-[80%] flex-shrink-0">
          <h3 className="text-lg font-bold text-black mb-4">Фільтри</h3>
          <form className="space-y-4">
            <div>
              <label className="block text-black mb-2">Пошук:</label>
              <input
                type="text"
                placeholder="Введіть назву"
                className="w-full p-2 border border-gray-800"
                value={searchTerm}
                onChange={(e) => setSearchTerm(e.target.value)}
              />
            </div>
            <div>
              <label className="block text-black mb-2">Категорія:</label>
              <select
                className="w-full p-2 border border-gray-800"
                value={selectedCategory}
                onChange={(e) => setSelectedCategory(e.target.value)}
              >
                <option>Всі категорії</option>
                <option>Історичні</option>
                <option>Природні</option>
                <option>Культурні</option>
              </select>
            </div>
            <button
              type="button"
              onClick={() => {
                setSearchTerm("");
                setSelectedCategory("Всі категорії");
              }}
              className="w-full bg-black text-white p-2 shadow hover:bg-gray-800"
            >
              Скинути фільтри
            </button>
          </form>
        </div>

        {/* Список карток місць справа */}
        <div className="w-[85%] p-6">
          <h2 className="text-3xl font-extrabold text-black mb-8">Місця</h2>
          <div className="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-8">
            {filteredPlaces.map((place) => (
              <div
                key={place.id}
                className="bg-white p-4 shadow-md hover:shadow-lg transition-shadow cursor-pointer"
                onClick={() => handlePlaceClick(place)}
              >
                <img
                  src={place.image}
                  alt={place.title}
                  className="w-full h-40 object-cover mb-4"
                />
                <div className="text-xl font-bold text-black mb-2">{place.title}</div>
                
              </div>
            ))}
          </div>

          {/* Модальне вікно з деталями місця */}
{selectedPlace && (
  <div className="fixed inset-0 bg-black bg-opacity-70 z-50 flex items-center justify-center">
    <div className="bg-white p-8 shadow-xl rounded-lg max-w-16xl w-full">
      <button
        className="absolute top-4 right-4 text-black text-3xl font-bold"
        onClick={handleCloseModal}
      >
        &times;
      </button>
      <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
        <div className="relative">
          <img
            src={selectedPlace.image}
            alt={selectedPlace.title}
            className="w-full h-full object-cover rounded-lg"
          />
        </div>
        <div className="flex flex-col justify-between">
          <div>
            <h3 className="text-2xl font-bold text-black">{selectedPlace.title}</h3>
            <p className="text-gray-800 mt-2">{selectedPlace.description}</p>
          </div>
          <div className="mt-6">
            <h4 className="font-semibold text-black">Адреса:</h4>
            <p className="text-gray-700">{selectedPlace.location}</p>
          </div>
          <div className="mt-4">
            <h4 className="font-semibold text-black">Карта:</h4>
            <a
              href={selectedPlace.map}
              target="_blank"
              rel="noopener noreferrer"
              className="text-blue-500 underline"
            >
              Переглянути на карті
            </a>
          </div>
        </div>
      </div>
    </div>
  </div>
)}
        </div>
      </section>
    </div>
  );
};

export default Places;
